# Pandas
## 1 What is Pandas?
## 2 Series
## 3 Basic Operations on Series
## 4 Dataframe 
## 5 Basic operations on dataframe
## 6 File related operations on dataframe
## 7 Visualizatoin
## 8 Practice Example

# pandas
Pandas is a tool for data processing which helps in data analysis
It provides functions and methods to efficently manipulate large data sets.
# Data structures in Pandas
Series (one-dimensional array)
DataFrame(two-dimensional array)
# series 
It is a one-dimensional array with labels. It can contain
any data type including integers, strings, float, Python objects and more.
# DataFrame:
It is a two-dimensional data structure with labels. We can use labels to locate data.

In [2]:
import pandas as pd

In [3]:
print(pd.__version__)

1.4.4

## Series

# series create, manuplate, querry, delete

In [4]:
# creating a series
arr = [1, 3, 4, 5, 6]
s1 = pd.Series(arr)
s1

0    1
1    3
2    4
3    5
4    6
dtype: int64

In [5]:
order = ['a', 'b', 'c', 'd', 'e']
s2 = pd.Series(arr, index = order)
s2

a    1
b    3
c    4
d    5
e    6
dtype: int64

In [6]:
#create a random  nd arry
import numpy as np
n = np.random.randn(5)
n

array([ 0.64908667, -0.68879713,  0.45604702, -0.9241774 , -1.2353504 ])

In [5]:
import numpy as np
n = np.random.randn(5)
index = ['a ', 'b', 'c', 'd', 'e']
s3 = pd.Series(n, index = index)
s3

a     1.560084
b     0.871711
c     0.435283
d     2.113427
e    -0.204755
dtype: float64

In [8]:
# creating series from dictionary 
d = {"a":1, "b":2, "c":3, "d":4, "e":5}
s4 = pd.Series(d)
s4

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
# modifying the index of series
s1
s1.index = ['q', 'w', 'e', 'r', 't']
s1

q    1
w    3
e    4
r    5
t    6
dtype: int64

In [10]:
# silicing in series
s1[:3]

q    1
w    3
e    4
dtype: int64

In [11]:
s1[:-2]

q    1
w    3
e    4
dtype: int64

In [12]:
s1[2:]

e    4
r    5
t    6
dtype: int64

In [13]:
#apend
s5 = s1.append(s3)
s5

C:\Users\Atizaz Hussain\AppData\Local\Temp\ipykernel_7180\1715993936.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s5 = s1.append(s3)

q     1.000000
w     3.000000
e     4.000000
r     5.000000
t     6.000000
a    -0.226834
b     0.865650
c     1.048255
d    -0.395806
e    -1.697937
dtype: float64

In [14]:
s5.drop('e')

q     1.000000
w     3.000000
r     5.000000
t     6.000000
a    -0.226834
b     0.865650
c     1.048255
d    -0.395806
dtype: float64

# Series Operation

In [15]:
arr1 = [0, 1,2, 3, 4, 5 ]
arr2 = [6, 7, 8, 9,10]

In [16]:
s7 = pd.Series(arr1)
s7

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [17]:
s6 = pd.Series(arr2)
s6

0     6
1     7
2     8
3     9
4    10
dtype: int64

In [18]:
s7.add(s6)# addition series

0     6.0
1     8.0
2    10.0
3    12.0
4    14.0
5     NaN
dtype: float64

In [19]:
s7.sub(s6)

0   -6.0
1   -6.0
2   -6.0
3   -6.0
4   -6.0
5    NaN
dtype: float64

In [20]:
s7.mul(s6)

0     0.0
1     7.0
2    16.0
3    27.0
4    40.0
5     NaN
dtype: float64

In [21]:
s7.div(s6)

0    0.000000
1    0.142857
2    0.250000
3    0.333333
4    0.400000
5         NaN
dtype: float64

In [22]:
s6.median()

8.0

In [23]:
s6.mode()

0     6
1     7
2     8
3     9
4    10
dtype: int64

In [24]:
s6.mean()

8.0

In [25]:
s7.max()

5

In [26]:
s7.min()

0

# DataFrame

In [27]:
import numpy as np
print('numpy imported ')

numpy imported

In [3]:
#create dataframe
date = pd.date_range('today', periods = 6)
date

DatetimeIndex(['2024-02-26 19:18:25.211952', '2024-02-27 19:18:25.211952',
               '2024-02-28 19:18:25.211952', '2024-02-29 19:18:25.211952',
               '2024-03-01 19:18:25.211952', '2024-03-02 19:18:25.211952'],
              dtype='datetime64[ns]', freq='D')

In [6]:
num = np.random.randn(6,6)
columns = ['a', 'b', 'c', 'd', 'e', 'f']

In [30]:
df = pd.DataFrame(num,index=date,columns=columns)
df

,a,b,c,d,e,f
2023-03-03 09:52:10.119420,1.066789,0.777129,-0.724006,-1.320635,-0.726429,-0.106387
2023-03-04 09:52:10.119420,-0.758190,0.637647,-1.910035,-0.305003,0.318743,-1.948873
2023-03-05 09:52:10.119420,-1.345016,-1.309100,1.157212,1.820633,-1.522375,0.779800
2023-03-06 09:52:10.119420,-0.313580,-2.184856,1.746291,1.865490,0.398171,0.165561
2023-03-07 09:52:10.119420,1.127765,-0.773036,-0.404373,-1.101184,1.275426,0.049935
2023-03-08 09:52:10.119420,-0.936392,-0.428431,-0.995406,-1.777452,-0.823507,-0.583913

In [31]:
data = {'animal':['cat', 'cow', 'dog'], 'Age':[2.5, 2.6, 1.8], 
        'visits' :[1, 2, 3], 'Priority':['yes', 'No', 'no']}

In [32]:
df1 = pd.DataFrame(data)
df1

  animal  Age  visits Priority
0    cat  2.5       1      yes
1    cow  2.6       2       No
2    dog  1.8       3       no

In [33]:
df1.columns

Index(['animal', 'Age', 'visits', 'Priority'], dtype='object')

In [34]:
df1.T

            0    1    2
animal    cat  cow  dog
Age       2.5  2.6  1.8
visits      1    2    3
Priority  yes   No   no

In [37]:
df1.sort_values(by='Age')

  animal  Age  visits Priority
2    dog  1.8       3       no
0    cat  2.5       1      yes
1    cow  2.6       2       No

In [38]:
# slicing the dataframe
df1[1:3]

  animal  Age  visits Priority
1    cow  2.6       2       No
2    dog  1.8       3       no

In [40]:
# query dataframe by tag
df1[['Age', 'visits'
   ]]

   Age  visits
0  2.5       1
1  2.6       2
2  1.8       3

In [41]:
df1.iloc[1:3] # query rows 2, 3

  animal  Age  visits Priority
1    cow  2.6       2       No
2    dog  1.8       3       no

In [43]:
df2 = df1.copy()
df2

  animal  Age  visits Priority
0    cat  2.5       1      yes
1    cow  2.6       2       No
2    dog  1.8       3       no

In [44]:
df2.isnull() # use to check the null value

   animal    Age  visits  Priority
0   False  False   False     False
1   False  False   False     False
2   False  False   False     False

In [47]:
df2.loc['f', 'Age'] = 1.5
df2

  animal  Age  visits Priority
0    cat  2.5     1.0      yes
1    cow  2.6     2.0       No
2    dog  1.8     3.0       no
f    NaN  1.5     NaN      NaN

In [48]:
df2[['Age']].mean()

Age    2.1
dtype: float64

In [49]:
df2['visits'].sum()

6.0

In [51]:
strn = pd.Series(['A', 'B', 'D', 'Aaa', np.nan, 'CBA'])
strn

0      A
1      B
2      D
3    Aaa
4    NaN
5    CBA
dtype: object

In [54]:
strn.str.lower()

0      a
1      b
2      d
3    aaa
4    NaN
5    cba
dtype: object

In [55]:
strn.str.upper()

0      A
1      B
2      D
3    AAA
4    NaN
5    CBA
dtype: object

# Operations for DataFrame Missing Values

In [57]:
df4 = df2.copy()
df4

  animal  Age  visits Priority
0    cat  2.5     1.0      yes
1    cow  2.6     2.0       No
2    dog  1.8     3.0       no
f    NaN  1.5     NaN      NaN

In [59]:
df4.fillna(4) # fill data in table

  animal  Age  visits Priority
0    cat  2.5     1.0      yes
1    cow  2.6     2.0       No
2    dog  1.8     3.0       no
f      4  1.5     4.0        4

In [61]:
df5 = df2.copy()
df5.dropna(how='any')

  animal  Age  visits Priority
0    cat  2.5     1.0      yes
1    cow  2.6     2.0       No
2    dog  1.8     3.0       no

# DataFrame file operations

In [63]:
df2.to_csv('animal.csv')

In [65]:
anim = pd.read_csv('animal.csv')
anim

  Unnamed: 0 animal  Age  visits Priority
0          0    cat  2.5     1.0      yes
1          1    cow  2.6     2.0       No
2          2    dog  1.8     3.0       no
3          f    NaN  1.5     NaN      NaN

In [69]:
df.to_excel('animal.xlsx', sheet_name = 'Sheet1')

anim2= pd.read_excel('animal.xlsx', 'Sheet1', index_col = None, na_values = ['NA'])
anim2

,Unnamed: 0,a,b,c,d,e,f
0,2023-03-03 09:52:10.119,1.066789,0.777129,-0.724006,-1.320635,-0.726429,-0.106387
1,2023-03-04 09:52:10.119,-0.758190,0.637647,-1.910035,-0.305003,0.318743,-1.948873
2,2023-03-05 09:52:10.119,-1.345016,-1.309100,1.157212,1.820633,-1.522375,0.779800
3,2023-03-06 09:52:10.119,-0.313580,-2.184856,1.746291,1.865490,0.398171,0.165561
4,2023-03-07 09:52:10.119,1.127765,-0.773036,-0.404373,-1.101184,1.275426,0.049935
5,2023-03-08 09:52:10.119,-0.936392,-0.428431,-0.995406,-1.777452,-0.823507,-0.583913